Cylinder_snappyHexMesh_turbulence/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        // solver          GAMG;
        // tolerance       1e-06;
        // relTol          0.1;
        // smoother        GaussSeidel;
        
        solver          PCG;
	    preconditioner 	DIC;
	    tolerance	1e-6;
        relTol		0.01;
        // minIter 	3;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
        
        //solver          PBiCG;
        // solver          PBiCGStab;
        // preconditioner  DILU;
        // tolerance       1e-8;
        // relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;

    residualControl
    {
        p               1e-4;
        U               1e-5;
        "(k|epsilon|omega|f|v2)" 1e-5;
    }
}

relaxationFactors
{
    // equations
    // {
    //     U               0.9; // 0.9 is more stable but 0.95 more convergent
    //     ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    // }
    fields
    {
        p               0.7;
    }
    equations
    {
        U               0.7;
        k               0.7;
        omega           0.7;
        epsilon         0.7;
        nuTilda         0.7;
    }
}


// ************************************************************************* //
