Cylinder_snappyHexMesh_turbulence/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The locations of the sample profiles correspond to:
// Hargreaves-Wright (2007), Fig.6
// DOI:10.1016/j.jweia.2006.08.002

sampleDict
{
    type                    sets;
    libs                    (sampling);
    setFormat               raw;
    interpolationScheme     cell;
    fields                  (U);
    writeControl            writeTime;

    sets
    (
        z_0.001m    
        {
            type        face;
            axis        xyz;
            start       (-0.01 0 0.001);
            end         ( 0.01 0 0.001);
        }
        z_0.05m    
        {
            type        face;
            axis        xyz;
            start       (-0.01 0 0.05);
            end         ( 0.01 0 0.05);
        }
        z_0.1m    
        {
            type        face;
            axis        xyz;
            start       (-0.01 0 0.1);
            end         ( 0.01 0 0.1);
        }
        z_0.15m
        {
            type        face;
            axis        xyz;
            start       (-0.01 0 0.15);
            end         ( 0.01 0 0.15);
        }
    );
}


// *********************************************************************** //
